Revit 2026 API
FamilyParameter.GUID Property
The globally unique identifier
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Guid GUID { get; }
Public ReadOnly Property GUID As Guid
	Get
public:
property Guid GUID {
	Guid get ();
}
member GUID : Guid with get
Property Value
Guid
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the parameter is not a shared parameter.
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace